# Chapter 3. Working with Multiple Tables

In [1]:
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 3.1 Stacking One Rowset atop Another

In [2]:
%%sql
select ename as ename_and_dname, deptno
from emp
where deptno = 10
union all
select '----------', null
union all
select dname, deptno
from dept;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
8 rows affected.

[('CLARK', 10),
 ('KING', 10),
 ('MILLER', 10),
 ('----------', None),
 ('ACCOUNTING', 10),
 ('RESEARCH', 20),
 ('SALES', 30),
 ('OPERATIONS', 40)]

## 3.2 Combining Related Rows

In [3]:
%%sql
select ename, loc
from emp join dept using (deptno)
where deptno = 10;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[('CLARK', 'NEW YORK'), ('KING', 'NEW YORK'), ('MILLER', 'NEW YORK')]

In [4]:
%%sql
select ename, loc
from emp natural join dept
where deptno = 10;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[('CLARK', 'NEW YORK'), ('KING', 'NEW YORK'), ('MILLER', 'NEW YORK')]

## 3.3 Finding Rows in Common Between Two Tables

In [5]:
%%sql
with v as (
    select ename, job, sal
    from emp
    where job = 'CLERK'
)
select empno, ename, job, sal, deptno
from v natural join emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
4 rows affected.

[(7369, 'SMITH', 'CLERK', 800, 20),
 (7876, 'ADAMS', 'CLERK', 1100, 20),
 (7900, 'JAMES', 'CLERK', 950, 30),
 (7934, 'MILLER', 'CLERK', 1300, 10)]

## 3.4 Retrieving Values from One Table That Do Not Exist in Another

In [6]:
%%sql
select deptno from dept
    except
select deptno from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(40,)]

In [7]:
%%sql
select deptno
from dept
where not exists(select 1 from emp where emp.deptno = dept.deptno);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(40,)]

## 3.5 Retrieving Rows from One Table That Do Not Correspond to Rows in Another

In [8]:
%%sql
select *
from dept
where not exists(select 1 from emp where emp.deptno = dept.deptno);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(40, 'OPERATIONS', 'BOSTON')]

In [9]:
%%sql
select dept.*
from dept natural left join emp
where emp is null;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(40, 'OPERATIONS', 'BOSTON')]

## 3.6 Adding Joins to a Query Without Interfering with Other Joins

In [10]:
%%sql
with emp_bonus as (
    select *
    from (values (7369, '14-MAR-2005'::date, 1),
                 (7900, '14-MAR-2005'::date, 2),
                 (7788, '14-MAR-2005'::date, 3))
             as t(empno, received, type)
)
select ename, loc, received
from emp natural join dept
         natural left join emp_bonus
order by loc;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('WARD', 'CHICAGO', None),
 ('MARTIN', 'CHICAGO', None),
 ('JAMES', 'CHICAGO', datetime.date(2005, 3, 14)),
 ('TURNER', 'CHICAGO', None),
 ('BLAKE', 'CHICAGO', None),
 ('ALLEN', 'CHICAGO', None),
 ('SMITH', 'DALLAS', datetime.date(2005, 3, 14)),
 ('FORD', 'DALLAS', None),
 ('ADAMS', 'DALLAS', None),
 ('SCOTT', 'DALLAS', datetime.date(2005, 3, 14)),
 ('JONES', 'DALLAS', None),
 ('MILLER', 'NEW YORK', None),
 ('CLARK', 'NEW YORK', None),
 ('KING', 'NEW YORK', None)]

## 3.7 Determining Whether Two Tables Have the Same Data

In [11]:
%%sql
with v as (
    select * from emp where deptno != 10
    union all
    select * from emp where ename = 'WARD'
)
select * from emp
    except
select * from v;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10)]

## 3.8 Identifying and Avoiding Cartesian Products

In [12]:
%%sql
select ename, loc
from emp natural join dept
where deptno = 10;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[('CLARK', 'NEW YORK'), ('KING', 'NEW YORK'), ('MILLER', 'NEW YORK')]

## 3.9 Performing Joins When Using Aggregates

In [13]:
%%sql
with emp_bonus as (
    select *
    from (values (7934, '17-MAR-2005'::date, 1),
                 (7934, '15-FEB-2005'::date, 2),
                 (7839, '15-FEB-2005'::date, 3),
                 (7782, '15-FEB-2005'::date, 1))
             as t(empno, received, type)
)
select empno,
       ename,
       sal,
       deptno,
       received,
       sal * type * .1 as bonus
from emp natural join emp_bonus
where deptno = 10;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
4 rows affected.

[(7782, 'CLARK', 2450, 10, datetime.date(2005, 2, 15), Decimal('245.0')),
 (7839, 'KING', 5000, 10, datetime.date(2005, 2, 15), Decimal('1500.0')),
 (7934, 'MILLER', 1300, 10, datetime.date(2005, 3, 17), Decimal('130.0')),
 (7934, 'MILLER', 1300, 10, datetime.date(2005, 2, 15), Decimal('260.0'))]

In [14]:
%%sql
with
    emp_bonus as (
        select *
        from (values (7934, '17-MAR-2005'::date, 1),
                     (7934, '15-FEB-2005'::date, 2),
                     (7839, '15-FEB-2005'::date, 3),
                     (7782, '15-FEB-2005'::date, 1))
                 as t(empno, received, type)
    ),
    dept10 as (
        select empno,
               ename,
               sal,
               deptno,
               sum(sal * type * .1) as bonus
        from emp natural left join emp_bonus
        where deptno = 10
        group by empno, ename, sal, deptno
    )
select deptno,
       sum(sal)   as total_sal,
       sum(bonus) as total_bonus
from dept10
group by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(10, 8750, Decimal('2135.0'))]

## 3.10 Performing Outer Joins When Using Aggregates

In [15]:
%%sql
with emp_bonus as (
    select *
    from (values (7934, '17-MAR-2005'::date, 1),
                 (7934, '15-FEB-2005'::date, 2))
             as t(empno, received, type)
)
select deptno,
       sum(sal)   as total_sal,
       sum(bonus) as total_bonus
from emp natural left join (
    select empno,
           sum(sal * type * .1) as bonus
    from emp_bonus natural join emp
    group by empno
) _
where deptno = 10
group by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(10, 8750, Decimal('390.0'))]

## 3.11 Returning Missing Data from Multiple Tables

In [16]:
%%sql
with emp as (
    select empno,
           ename,
           job,
           mgr,
           hiredate,
           sal,
           comm,
           deptno
    from emp
    union
    select 1111,
           'YODA',
           'JEDI',
           null,
           hiredate,
           sal,
           comm,
           null
    from emp
    where ename = 'KING'
)
select deptno, dname, ename
from dept natural full join emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
16 rows affected.

[(10, 'ACCOUNTING', 'KING'),
 (10, 'ACCOUNTING', 'CLARK'),
 (10, 'ACCOUNTING', 'MILLER'),
 (20, 'RESEARCH', 'SMITH'),
 (20, 'RESEARCH', 'FORD'),
 (20, 'RESEARCH', 'JONES'),
 (20, 'RESEARCH', 'ADAMS'),
 (20, 'RESEARCH', 'SCOTT'),
 (30, 'SALES', 'TURNER'),
 (30, 'SALES', 'MARTIN'),
 (30, 'SALES', 'WARD'),
 (30, 'SALES', 'JAMES'),
 (30, 'SALES', 'ALLEN'),
 (30, 'SALES', 'BLAKE'),
 (40, 'OPERATIONS', None),
 (None, None, 'YODA')]

## 3.12 Using NULLs in Operations and Comparisons

In [17]:
%%sql
select *
from emp
where coalesce(comm, 0) < (
    select comm
    from emp
    where ename = 'WARD'
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
12 rows affected.

[(7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(2006, 2, 20), 1600, 300, 30),
 (7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, datetime.date(2006, 12, 3), 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10)]